### Задание 1
#
# У вас есть строка
# line = "13fet35kk54"
# Выведите, сколько чисел в строке и сколько букв
# Всего чисел: 6
# Всего букв: 5

### Задание 2

# У вас есть строка, посчитайте, какой процент от нее составляют пробелы
line = "13f et3 5kk54"
# Пример вывода:
# Пробелов: 2, это 20%

### Задание 3

# У вас есть строка, посчитайте, какое количество слов являются хештегами (начинаются с решетки)
# сегодня #прогулка# #еда #ко#ты

### Задание 4

# У вас есть строка, посчитайте количество заглавных букв в ней
# line = "A13f et3 D 5kk54 M"

### Задание 5

# У вас есть список строк, составьте словарь, где будет длина каждой:
# words = ["abcd", "ab", "bcdef"]

### Задание 6
#
# У вас есть строка.
# abcdefghijklmnopqrstuvwxyz
# Со стандартного ввода подаются два числа x и y, разделенные дефисом.
# 1-4
# Верните буквы в соответствующем интервале (от x до y) ВКЛЮЧИТЕЛЬНО. Пример вывода bcde

### Задача 7

# У вас есть список, составьте на его основе словарь с акронимами (первые буквы)
# Исходный список:
# words = ["Alpha", "Charlie"]
# Пример результата
# {"Alpha": "A", "Charlie": "C"}

# Задача 8
# Со стандартного ввода полдается строка в формате `x abcde`

# Первый символ это число, после пробела – строка.

# Нужно вывести символы abcde x раз
# Пример ввода:
# 2 xyz
# Пример вывода:
# xyz
# xyz

### Задача 9
#
# У вас есть словарь сокращений, выведите слова для которых
# сокращения составлены неверно c указанием правильных сокращений.
#
# words = {"Alpha": "A", "Bravo":"V", "Charlie": "C", "Delta": "D", "Echo": "H"}
#
# Пример вывода
# B is for Bravo
# E is for Echo


# ### Задача 10
#
# У вас есть список слов, составьте словарь, в формате слово - количество букв. Распечатайте словарь.
# keywords = ["Желание", "Семнадцать", "Ржавый", "Пропуск", "Печь" ]
#
# Формат словаря:
# {
# "Желание": 7,
# "Семнадцать": 10,
# "Ржавый": 6,
# "Пропуск": 7,
# "Печь": 4
# }

### Задача 11 ЛУЧШЕ НЕ РЕШАТЬ
#
# Попросите пользователя тремя разными строками вести год, число и месяц рождения.
#
# Запишите в словарь в формате:
# {
# "year": 2000,
# "month": 6,
# "day": 6,
# }
# Распечатайте словарь

### Задача 12
#
# У вас есть список покупок, выведите все названия
# {
#   "Мандаринки": 150,
#   "Шоколадные конфеты" : 200 ,
#   "Гирлянда": 400,
#   "Набор шаров": 300,
#   "Хлопушки": 150
# }
#
# Пример вывода:
# Мандаринки
# Шоколадные конфеты
# Гирлянда
# Набор шаров
# Хлопушки


### Задача 13
#
# У вас есть список покупок, выведите сумму
# {
#   "Мандаринки": 150,
#   "Шоколадные конфеты" : 200 ,
#   "Гирлянда": 400,
#   "Набор шаров": 300,
#   "Хлопушки": 150
# }
#Пример вывода:
# 1200

### Задача 14
#
# У вас есть список городов, с отметкой о том, какая там температура.
#
# Выведите только те города, где больше +10
#
# {
#   "Джакарта": 25,
#   "Норильск" : -34 ,
#   "Бангкок": 21,
#   "Якутск": -52,
# 	"Москва": 5,
# }

# Задача 15
#
# Со стандартного ввода поступает фраза,
# посчитайте, сколько раз в ней встречается буква “р”.
# Выведите ответ числом.
#
#
# Пример 2. Газетные вырезки
# Даны две строки A и B. Написать программу, определяющую,
# можно ли составить строку B,
# используя только символы из строки A (каждую букву можно использовать только один раз).
#


# ЛУЧШЕ НЕ РЕШАТЬ
# Задача 16
# NRZI кодирование
# NRZI (Non Return to Zero Invertive) —
# один из способов линейного кодирования.
# Если имеется некое устройство, которое способно
# находиться лишь в двух различных состояниях,
# можно построить диаграмму состояний устройства
# на каждом такте с помощью двоичных 1 и 0.
# Напишите программу для перевода NRZI кода в двоичный:
# изменение состояния устройства в этом случае обозначается двоичной единицей 1,
# а неизменное состояние принимается за 0.
# #Пример ввода:
# user_input = "_|¯|____|¯|__|¯¯¯"


# https://skyengpublic.notion.site/PD-4-6706a4758a334043bf4e442bcfe011d9#692fed9fc2ba4bbfb23a65418317b44d