# Задача 1

# В переменной `points` указано количество баллов за контрольный тест.
# Если баллов больше 60, выведите сообщение “баллов достаточно”, если нет – ничего не выводите.
# Не используйте ввод.
points = 50
# Изменяйте значение переменной, чтобы проверить работу программы.

#Задача 2

# В переменной `corect_code` хранится код доступа,
# а в переменной хранится `user_code` код который когда-то ввел пользователь.
# Если они совпадают, выведите “Код разрешен”,
# если нет – ничего не выводите.
# Не используйте ввод.
corect_code = 5052
user_code = 5052
# Изменяйте значение переменной, чтобы проверить работу программы.

# Задача 3

# Пользователю предлагается ввести два числа.
# Введите число 1
# (пользователь вводит число)
# Введите число 2
# (пользователь вводит число)
# Числа записываются в переменные.
# Если эти числа равны, программа выводит “равно”, если нет “не равно”

# Задача 4

# Программа запрашивает у пользователя номер дня и определяет, может ли быть в месяце такое число.
# Если число от 1 до 28 программа выводит:
# Такое количество дней в месяце точно есть
# Если от 29 до 31 :
# Такое количество дней в месяце возможно есть
# Иначе:
# Такого количества в месяце точно нет

# Задача 5

# Программа предлагает ввести пользователю год своего рождения
# и на основе текущего года (2023) считает его возраст в таком формате:
# Вам от 22 до 23

# Задача 6 : 16 пудов

# Пользователь вводит вес некоторого предмета в пудах (все значения целые),
# программа должна сделать вывод в килограммах в формате:

# 1 пуд – это примерно 16 килограмм
# 2 пуда это 32 килограмм

### Задача 7: Локация

# В некоторой местности все города называются *-сити, все поселки *-вилль, при этом маленькими буквами.
#
# Пользователь вводит название города (включает “сити”) программа выводит:
# пайтон сити – это город
# Пользователь вводит название поселка (включает “вилль”) программа выводит:
# пайтон вилль - это поселок
# Если в топониме нет ни того, ни другого , программа выводит:
# пайтон вэлли - это непонятно что
# Список для проверки
# монти вилль
# брайан сити
# смоллвилль


# Задача 8

# Пользователь вводит номер дня недели например, `2`,
# программа сообщает его название на казахском или болгарском языке
# дүйсенбi
# сейсенбi
# сәрсенбі
# бейсенбі
# жұма
# сенбі
# жексенбi
#
# Понеделник
# Вторник
# Сряда
# Четвъртък
# Петък
# Събота
# Неделя

# Задача 9 - уровень скидки

# Уровень скидки пользователя высчитывается так:
#
# от 5000 - 2 %
# от 10000 - 5%
# от 25000 - 10%
# иначе – 0%
#
# Пользователь вводит свою сумму покупок, а программа выводит
# Ваш уровень скидки 5%

# Задача 10

# В переменных is_weekend и has_vacation хранится две булевых
is_weekend = True # сейчас выходные
has_vacation = True # сейчас каникулы
# Если у нас каникулы - выведите "не идем на работу"
# Если у нас будний день и нет каникул - выведите "идем на работу"
# Если у нас выходной - выведите "не идем на работу".
# Изменяйте значения, чтобы проверить работу программы.
