# 1
# Получить из файла data.txt строку и вывести ее в консоли
# # data.txt:
#
# Все работает
# # Пример вывода:
#
# Все работает

# 2
# Получить из файла data.txt все строки вывести построчно

# # Пример файла:
#
# Содержимое файла
# Выводится посточно
# И это отлично
# # Пример вывода:
# Содержимое файла
# ---
# Выводится посточно
# ---
# И это отлично
# ---

# 3
# Получите из файла записанный построчно список, превратите его в тип list, выведите построчно
# # Пример файла:
#
# Alpha
# Bravo
# Charlie
# Delta
# Echo
# # Пример вывода:
#
# 1 Alpha
# 2 Bravo
# 3 Charlie
# 4 Delta
# 5 Echo

# 4
# Получите из файла записанный построчно список расходов, превратите его в тип list, просуммируйте, найдите среднее.
# # Пример файла:
#
# 1500
# 750
# 1350
# 1100
# 800
#
# # Пример вывода:
#
# Сумма: 5400
# Среднее: 950

# 5
# Напишите функцию `load_list_from_file(path)` которая получает из файла,
# путь которого передан, список и возвращает его в виде типа list.
#
# # Пример файла:
#
# 2015
# 2016
# 2017
# 2018
# 2019
# 2020
# 2021
# Пример вывода:
# [2015, 2016, ...]

# 6
# Напишите функцию `load_dict_from_file(path)` которая получает из файла,
# путь которого передан, список и возвращает его в структуре данных
# `dict` - ключи в числах, значения в строках
# Пример файла:
# 1 A
# 2 B
# 3 C
# 4 D
# Пример вывода:
# {1:"A", 2: "B", 3: "C", ...}

# 7
# Получите от пользователя строку со стандартного ввода.
#
# Запишите ее в файл recorded.txt

# 8
# Получите от пользователя три строки со стандартного ввода
# Запишите их тремя отдельными строками в файл
#
# friendship
# is
# magic

# 9
# В файле `expanses.txt` содержится список расходов

# 1500
# 750
# 1350
# 1100
# 800

# Запишите информацию о них (минимум, максимум, сумма) в файле `info.txt` в формате
# min: 750
# max: 1500
# sum: 6700

# 10
# Получите от пользователя число от 1 до 5 со стандартного ввода.
# Создайте соответствующее количество файлов типа 1.txt 2.txt 3.txt и так далее
# В каждом файле разместите строку “файл создан”

