# **Задание 1 - подсчет количества**
#
# Напишите функцию, которая получала бы список булевых значений
# и возвращала бы количество True в полученном списке.

def count_for_true(elements):
    pass


print(count_for_true([True, True, True]))  # вернет 3
print(count_for_true([False, True, False]))  # вернет 1

